;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! tron-legacy-theme)
(package! spacemacs-theme)
(package! gruber-darker-theme)
(package! anti-zenburn-theme)
(package! ef-themes)

(package! google-translate)

(package! denote)
(package! denote-menu)
;; (package! consult-denote)

(package! odin-mode
  :recipe (:host sourcehut
           :repo "mgmarlow/odin-mode"))

(package! org-modern)
(package! org-fragtog)
(package! aas)
